; ModuleID = 'xdp_prog_kern_03.c'
source_filename = "xdp_prog_kern_03.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.icmphdr_common = type { i8, i8, i16 }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, i16, i32, %union.anon.0, %union.anon.1, %union.anon.2, i16, i16, [6 x i8], [6 x i8] }
%union.anon.0 = type { i32 }
%union.anon.1 = type { [4 x i32] }
%union.anon.2 = type { [4 x i32] }

@xdp_stats_map = dso_local global %struct.bpf_map_def { i32 6, i32 4, i32 16, i32 5, i32 0 }, section "maps", align 4, !dbg !0
@tx_port = dso_local global %struct.bpf_map_def { i32 14, i32 4, i32 4, i32 256, i32 0 }, section "maps", align 4, !dbg !76
@redirect_params = dso_local global %struct.bpf_map_def { i32 1, i32 6, i32 6, i32 1, i32 0 }, section "maps", align 4, !dbg !86
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !88

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !75, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern_03.c", directory: "/home/saif/Desktop/xdp-tutorial/packet-solutions")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/saif/Desktop/xdp-tutorial/packet-solutions")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46, !49, !74, !71}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !47, line: 24, baseType: !48)
!47 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !51, line: 33, size: 128, elements: !52)
!51 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !50, file: !51, line: 40, baseType: !54, size: 128)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !50, file: !51, line: 34, size: 128, elements: !55)
!55 = !{!56, !62, !68}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !54, file: !51, line: 35, baseType: !57, size: 128)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !60)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !47, line: 21, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !{!61}
!61 = !DISubrange(count: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !54, file: !51, line: 37, baseType: !63, size: 128)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !66)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !65, line: 25, baseType: !46)
!65 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!66 = !{!67}
!67 = !DISubrange(count: 8)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !54, file: !51, line: 38, baseType: !69, size: 128)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !72)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !65, line: 27, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !47, line: 27, baseType: !7)
!72 = !{!73}
!73 = !DISubrange(count: 4)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!75 = !{!0, !76, !86, !88, !92, !101, !109, !116, !121}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 19, type: !78, isLocal: false, isDefinition: true)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !79, line: 33, size: 160, elements: !80)
!79 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/saif/Desktop/xdp-tutorial/packet-solutions")
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !79, line: 34, baseType: !7, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !78, file: !79, line: 35, baseType: !7, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !78, file: !79, line: 36, baseType: !7, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !78, file: !79, line: 37, baseType: !7, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !78, file: !79, line: 38, baseType: !7, size: 32, offset: 128)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "redirect_params", scope: !2, file: !3, line: 26, type: !78, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 333, type: !90, isLocal: false, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !72)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !94, line: 764, type: !95, isLocal: true, isDefinition: true)
!94 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/saif/Desktop/xdp-tutorial/packet-solutions")
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !74, !71, !74, !71, !100}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !47, line: 30, baseType: !99)
!99 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !65, line: 32, baseType: !71)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !94, line: 589, type: !103, isLocal: true, isDefinition: true)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !71, !107}
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !47, line: 31, baseType: !108)
!108 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !94, line: 33, type: !111, isLocal: true, isDefinition: true)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!44, !44, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !94, line: 1254, type: !118, isLocal: true, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!106, !44, !71, !107}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !94, line: 1764, type: !123, isLocal: true, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!106, !44, !126, !106, !71}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 3179, size: 512, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !141, !147, !152, !153, !154, !158}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !127, file: !6, line: 3183, baseType: !58, size: 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !127, file: !6, line: 3186, baseType: !58, size: 8, offset: 8)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !127, file: !6, line: 3187, baseType: !64, size: 16, offset: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !127, file: !6, line: 3188, baseType: !64, size: 16, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !127, file: !6, line: 3191, baseType: !46, size: 16, offset: 48)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !127, file: !6, line: 3196, baseType: !71, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, scope: !127, file: !6, line: 3198, baseType: !136, size: 32, offset: 96)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !6, line: 3198, size: 32, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !136, file: !6, line: 3200, baseType: !58, size: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !136, file: !6, line: 3201, baseType: !70, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !136, file: !6, line: 3204, baseType: !71, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, scope: !127, file: !6, line: 3207, baseType: !142, size: 128, offset: 128)
!142 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !6, line: 3207, size: 128, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !142, file: !6, line: 3208, baseType: !70, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !142, file: !6, line: 3209, baseType: !146, size: 128)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !72)
!147 = !DIDerivedType(tag: DW_TAG_member, scope: !127, file: !6, line: 3216, baseType: !148, size: 128, offset: 256)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !6, line: 3216, size: 128, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !148, file: !6, line: 3217, baseType: !70, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !148, file: !6, line: 3218, baseType: !146, size: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !127, file: !6, line: 3222, baseType: !64, size: 16, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !127, file: !6, line: 3223, baseType: !64, size: 16, offset: 400)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !127, file: !6, line: 3224, baseType: !155, size: 48, offset: 416)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 48, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 6)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !127, file: !6, line: 3225, baseType: !155, size: 48, offset: 464)
!159 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/saif/Desktop/xdp-tutorial/packet-solutions")
!160 = !{i32 7, !"Dwarf Version", i32 4}
!161 = !{i32 2, !"Debug Info Version", i32 3}
!162 = !{i32 1, !"wchar_size", i32 4}
!163 = !{!"clang version 10.0.0-4ubuntu1 "}
!164 = distinct !DISubprogram(name: "xdp_icmp_echo_func", scope: !3, file: !3, line: 61, type: !165, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !175)
!165 = !DISubroutineType(types: !166)
!166 = !{!106, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !169)
!169 = !{!170, !171, !172, !173, !174}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !6, line: 2857, baseType: !71, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !168, file: !6, line: 2858, baseType: !71, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !168, file: !6, line: 2859, baseType: !71, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !168, file: !6, line: 2861, baseType: !71, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !168, file: !6, line: 2862, baseType: !71, size: 32, offset: 128)
!175 = !{!176, !177, !178, !179, !184, !193, !194, !195, !196, !213, !229, !230, !231, !238, !239, !240}
!176 = !DILocalVariable(name: "ctx", arg: 1, scope: !164, file: !3, line: 61, type: !167)
!177 = !DILocalVariable(name: "data_end", scope: !164, file: !3, line: 63, type: !44)
!178 = !DILocalVariable(name: "data", scope: !164, file: !3, line: 64, type: !44)
!179 = !DILocalVariable(name: "nh", scope: !164, file: !3, line: 65, type: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !181, line: 33, size: 64, elements: !182)
!181 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/saif/Desktop/xdp-tutorial/packet-solutions")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !180, file: !181, line: 34, baseType: !44, size: 64)
!184 = !DILocalVariable(name: "eth", scope: !164, file: !3, line: 66, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !187, line: 163, size: 112, elements: !188)
!187 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!188 = !{!189, !191, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !186, file: !187, line: 164, baseType: !190, size: 48)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 48, elements: !156)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !186, file: !187, line: 165, baseType: !190, size: 48, offset: 48)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !186, file: !187, line: 166, baseType: !64, size: 16, offset: 96)
!193 = !DILocalVariable(name: "eth_type", scope: !164, file: !3, line: 67, type: !106)
!194 = !DILocalVariable(name: "ip_type", scope: !164, file: !3, line: 68, type: !106)
!195 = !DILocalVariable(name: "icmp_type", scope: !164, file: !3, line: 69, type: !106)
!196 = !DILocalVariable(name: "iphdr", scope: !164, file: !3, line: 70, type: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !199, line: 86, size: 160, elements: !200)
!199 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !211, !212}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !198, file: !199, line: 88, baseType: !58, size: 4, flags: DIFlagBitField, extraData: i64 0)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !198, file: !199, line: 89, baseType: !58, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !198, file: !199, line: 96, baseType: !58, size: 8, offset: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !198, file: !199, line: 97, baseType: !64, size: 16, offset: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !199, line: 98, baseType: !64, size: 16, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !198, file: !199, line: 99, baseType: !64, size: 16, offset: 48)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !198, file: !199, line: 100, baseType: !58, size: 8, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !198, file: !199, line: 101, baseType: !58, size: 8, offset: 72)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !198, file: !199, line: 102, baseType: !210, size: 16, offset: 80)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !65, line: 31, baseType: !46)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !198, file: !199, line: 103, baseType: !70, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !198, file: !199, line: 104, baseType: !70, size: 32, offset: 128)
!213 = !DILocalVariable(name: "ipv6hdr", scope: !164, file: !3, line: 71, type: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !216, line: 116, size: 320, elements: !217)
!216 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!217 = !{!218, !219, !220, !224, !225, !226, !227, !228}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !215, file: !216, line: 118, baseType: !58, size: 4, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !215, file: !216, line: 119, baseType: !58, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !215, file: !216, line: 126, baseType: !221, size: 24, offset: 8)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 3)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !215, file: !216, line: 128, baseType: !64, size: 16, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !215, file: !216, line: 129, baseType: !58, size: 8, offset: 48)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !215, file: !216, line: 130, baseType: !58, size: 8, offset: 56)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !215, file: !216, line: 132, baseType: !50, size: 128, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !215, file: !216, line: 133, baseType: !50, size: 128, offset: 192)
!229 = !DILocalVariable(name: "echo_reply", scope: !164, file: !3, line: 72, type: !46)
!230 = !DILocalVariable(name: "old_csum", scope: !164, file: !3, line: 72, type: !46)
!231 = !DILocalVariable(name: "icmphdr", scope: !164, file: !3, line: 73, type: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr_common", file: !181, line: 51, size: 32, elements: !234)
!234 = !{!235, !236, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !181, line: 52, baseType: !58, size: 8)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !233, file: !181, line: 53, baseType: !58, size: 8, offset: 8)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !233, file: !181, line: 54, baseType: !210, size: 16, offset: 16)
!238 = !DILocalVariable(name: "icmphdr_old", scope: !164, file: !3, line: 74, type: !233)
!239 = !DILocalVariable(name: "action", scope: !164, file: !3, line: 75, type: !71)
!240 = !DILabel(scope: !164, name: "out", file: !3, line: 148)
!241 = !DILocalVariable(name: "tmp", scope: !242, file: !243, line: 127, type: !50)
!242 = distinct !DISubprogram(name: "swap_src_dst_ipv6", scope: !243, file: !243, line: 125, type: !244, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !246)
!243 = !DIFile(filename: "./../common/rewrite_helpers.h", directory: "/home/saif/Desktop/xdp-tutorial/packet-solutions")
!244 = !DISubroutineType(types: !245)
!245 = !{null, !214}
!246 = !{!247, !241}
!247 = !DILocalVariable(name: "ipv6", arg: 1, scope: !242, file: !243, line: 125, type: !214)
!248 = !DILocation(line: 127, column: 18, scope: !242, inlinedAt: !249)
!249 = distinct !DILocation(line: 108, column: 3, scope: !250)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 106, column: 43)
!251 = distinct !DILexicalBlock(scope: !252, file: !3, line: 105, column: 13)
!252 = distinct !DILexicalBlock(scope: !164, file: !3, line: 101, column: 6)
!253 = !DILocalVariable(name: "h_tmp", scope: !254, file: !243, line: 115, type: !155)
!254 = distinct !DISubprogram(name: "swap_src_dst_mac", scope: !243, file: !243, line: 113, type: !255, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !257)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !185}
!257 = !{!258, !253}
!258 = !DILocalVariable(name: "eth", arg: 1, scope: !254, file: !243, line: 113, type: !185)
!259 = !DILocation(line: 115, column: 7, scope: !254, inlinedAt: !260)
!260 = distinct !DILocation(line: 115, column: 2, scope: !164)
!261 = !DILocation(line: 0, scope: !164)
!262 = !DILocation(line: 63, column: 38, scope: !164)
!263 = !{!264, !265, i64 4}
!264 = !{!"xdp_md", !265, i64 0, !265, i64 4, !265, i64 8, !265, i64 12, !265, i64 16}
!265 = !{!"int", !266, i64 0}
!266 = !{!"omnipotent char", !267, i64 0}
!267 = !{!"Simple C/C++ TBAA"}
!268 = !DILocation(line: 63, column: 27, scope: !164)
!269 = !DILocation(line: 63, column: 19, scope: !164)
!270 = !DILocation(line: 64, column: 34, scope: !164)
!271 = !{!264, !265, i64 0}
!272 = !DILocation(line: 64, column: 23, scope: !164)
!273 = !DILocation(line: 64, column: 15, scope: !164)
!274 = !DILocation(line: 74, column: 2, scope: !164)
!275 = !DILocalVariable(name: "nh", arg: 1, scope: !276, file: !181, line: 124, type: !279)
!276 = distinct !DISubprogram(name: "parse_ethhdr", scope: !181, file: !181, line: 124, type: !277, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !281)
!277 = !DISubroutineType(types: !278)
!278 = !{!106, !279, !44, !280}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!281 = !{!275, !282, !283}
!282 = !DILocalVariable(name: "data_end", arg: 2, scope: !276, file: !181, line: 125, type: !44)
!283 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !276, file: !181, line: 126, type: !280)
!284 = !DILocation(line: 0, scope: !276, inlinedAt: !285)
!285 = distinct !DILocation(line: 81, column: 13, scope: !164)
!286 = !DILocalVariable(name: "nh", arg: 1, scope: !287, file: !181, line: 79, type: !279)
!287 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !181, file: !181, line: 79, type: !288, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !297)
!288 = !DISubroutineType(types: !289)
!289 = !{!106, !279, !44, !280, !290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !181, line: 64, size: 32, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !291, file: !181, line: 65, baseType: !294, size: 32)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 2)
!297 = !{!286, !298, !299, !300, !301, !302, !303, !309, !310}
!298 = !DILocalVariable(name: "data_end", arg: 2, scope: !287, file: !181, line: 80, type: !44)
!299 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !287, file: !181, line: 81, type: !280)
!300 = !DILocalVariable(name: "vlans", arg: 4, scope: !287, file: !181, line: 82, type: !290)
!301 = !DILocalVariable(name: "eth", scope: !287, file: !181, line: 84, type: !185)
!302 = !DILocalVariable(name: "hdrsize", scope: !287, file: !181, line: 85, type: !106)
!303 = !DILocalVariable(name: "vlh", scope: !287, file: !181, line: 86, type: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !181, line: 42, size: 32, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !305, file: !181, line: 43, baseType: !64, size: 16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !305, file: !181, line: 44, baseType: !64, size: 16, offset: 16)
!309 = !DILocalVariable(name: "h_proto", scope: !287, file: !181, line: 87, type: !46)
!310 = !DILocalVariable(name: "i", scope: !287, file: !181, line: 88, type: !106)
!311 = !DILocation(line: 0, scope: !287, inlinedAt: !312)
!312 = distinct !DILocation(line: 129, column: 9, scope: !276, inlinedAt: !285)
!313 = !DILocation(line: 93, column: 14, scope: !314, inlinedAt: !312)
!314 = distinct !DILexicalBlock(scope: !287, file: !181, line: 93, column: 6)
!315 = !DILocation(line: 93, column: 24, scope: !314, inlinedAt: !312)
!316 = !DILocation(line: 93, column: 6, scope: !287, inlinedAt: !312)
!317 = !DILocation(line: 97, column: 10, scope: !287, inlinedAt: !312)
!318 = !DILocation(line: 99, column: 17, scope: !287, inlinedAt: !312)
!319 = !{!320, !320, i64 0}
!320 = !{!"short", !266, i64 0}
!321 = !DILocation(line: 0, scope: !322, inlinedAt: !312)
!322 = distinct !DILexicalBlock(scope: !323, file: !181, line: 109, column: 7)
!323 = distinct !DILexicalBlock(scope: !324, file: !181, line: 105, column: 39)
!324 = distinct !DILexicalBlock(scope: !325, file: !181, line: 105, column: 2)
!325 = distinct !DILexicalBlock(scope: !287, file: !181, line: 105, column: 2)
!326 = !DILocation(line: 105, column: 2, scope: !325, inlinedAt: !312)
!327 = !DILocation(line: 106, column: 7, scope: !323, inlinedAt: !312)
!328 = !DILocation(line: 109, column: 11, scope: !322, inlinedAt: !312)
!329 = !DILocation(line: 109, column: 15, scope: !322, inlinedAt: !312)
!330 = !DILocation(line: 109, column: 7, scope: !323, inlinedAt: !312)
!331 = !DILocation(line: 112, column: 18, scope: !323, inlinedAt: !312)
!332 = !DILocation(line: 82, column: 6, scope: !164)
!333 = !DILocalVariable(name: "nh", arg: 1, scope: !334, file: !181, line: 151, type: !279)
!334 = distinct !DISubprogram(name: "parse_iphdr", scope: !181, file: !181, line: 151, type: !335, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !338)
!335 = !DISubroutineType(types: !336)
!336 = !{!106, !279, !44, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!338 = !{!333, !339, !340, !341, !342}
!339 = !DILocalVariable(name: "data_end", arg: 2, scope: !334, file: !181, line: 152, type: !44)
!340 = !DILocalVariable(name: "iphdr", arg: 3, scope: !334, file: !181, line: 153, type: !337)
!341 = !DILocalVariable(name: "iph", scope: !334, file: !181, line: 155, type: !197)
!342 = !DILocalVariable(name: "hdrsize", scope: !334, file: !181, line: 156, type: !106)
!343 = !DILocation(line: 0, scope: !334, inlinedAt: !344)
!344 = distinct !DILocation(line: 83, column: 13, scope: !345)
!345 = distinct !DILexicalBlock(scope: !346, file: !3, line: 82, column: 39)
!346 = distinct !DILexicalBlock(scope: !164, file: !3, line: 82, column: 6)
!347 = !DILocation(line: 158, column: 10, scope: !348, inlinedAt: !344)
!348 = distinct !DILexicalBlock(scope: !334, file: !181, line: 158, column: 6)
!349 = !DILocation(line: 158, column: 14, scope: !348, inlinedAt: !344)
!350 = !DILocation(line: 158, column: 6, scope: !334, inlinedAt: !344)
!351 = !DILocation(line: 161, column: 17, scope: !334, inlinedAt: !344)
!352 = !DILocation(line: 161, column: 21, scope: !334, inlinedAt: !344)
!353 = !DILocation(line: 163, column: 13, scope: !354, inlinedAt: !344)
!354 = distinct !DILexicalBlock(scope: !334, file: !181, line: 163, column: 5)
!355 = !DILocation(line: 163, column: 5, scope: !334, inlinedAt: !344)
!356 = !DILocation(line: 163, column: 5, scope: !354, inlinedAt: !344)
!357 = !DILocation(line: 167, column: 14, scope: !358, inlinedAt: !344)
!358 = distinct !DILexicalBlock(scope: !334, file: !181, line: 167, column: 6)
!359 = !DILocation(line: 167, column: 24, scope: !358, inlinedAt: !344)
!360 = !DILocation(line: 167, column: 6, scope: !334, inlinedAt: !344)
!361 = !DILocation(line: 171, column: 9, scope: !334, inlinedAt: !344)
!362 = !DILocation(line: 173, column: 14, scope: !334, inlinedAt: !344)
!363 = !{!364, !266, i64 9}
!364 = !{!"iphdr", !266, i64 0, !266, i64 0, !266, i64 1, !320, i64 2, !320, i64 4, !320, i64 6, !266, i64 8, !266, i64 9, !320, i64 10, !265, i64 12, !265, i64 16}
!365 = !DILocation(line: 84, column: 15, scope: !366)
!366 = distinct !DILexicalBlock(scope: !345, file: !3, line: 84, column: 7)
!367 = !DILocation(line: 84, column: 7, scope: !345)
!368 = !DILocalVariable(name: "nh", arg: 1, scope: !369, file: !181, line: 132, type: !279)
!369 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !181, file: !181, line: 132, type: !370, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !373)
!370 = !DISubroutineType(types: !371)
!371 = !{!106, !279, !44, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!373 = !{!368, !374, !375, !376}
!374 = !DILocalVariable(name: "data_end", arg: 2, scope: !369, file: !181, line: 133, type: !44)
!375 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !369, file: !181, line: 134, type: !372)
!376 = !DILocalVariable(name: "ip6h", scope: !369, file: !181, line: 136, type: !214)
!377 = !DILocation(line: 0, scope: !369, inlinedAt: !378)
!378 = distinct !DILocation(line: 87, column: 13, scope: !379)
!379 = distinct !DILexicalBlock(scope: !380, file: !3, line: 86, column: 48)
!380 = distinct !DILexicalBlock(scope: !346, file: !3, line: 86, column: 13)
!381 = !DILocation(line: 142, column: 11, scope: !382, inlinedAt: !378)
!382 = distinct !DILexicalBlock(scope: !369, file: !181, line: 142, column: 6)
!383 = !DILocation(line: 142, column: 17, scope: !382, inlinedAt: !378)
!384 = !DILocation(line: 142, column: 15, scope: !382, inlinedAt: !378)
!385 = !DILocation(line: 142, column: 6, scope: !369, inlinedAt: !378)
!386 = !DILocation(line: 136, column: 29, scope: !369, inlinedAt: !378)
!387 = !DILocation(line: 148, column: 15, scope: !369, inlinedAt: !378)
!388 = !{!389, !266, i64 6}
!389 = !{!"ipv6hdr", !266, i64 0, !266, i64 0, !266, i64 1, !320, i64 4, !266, i64 6, !266, i64 7, !390, i64 8, !390, i64 24}
!390 = !{!"in6_addr", !266, i64 0}
!391 = !DILocation(line: 88, column: 15, scope: !392)
!392 = distinct !DILexicalBlock(scope: !379, file: !3, line: 88, column: 7)
!393 = !DILocation(line: 88, column: 7, scope: !379)
!394 = !DILocation(line: 78, column: 9, scope: !164)
!395 = !DILocalVariable(name: "nh", arg: 1, scope: !396, file: !181, line: 206, type: !279)
!396 = distinct !DISubprogram(name: "parse_icmphdr_common", scope: !181, file: !181, line: 206, type: !397, scopeLine: 209, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !400)
!397 = !DISubroutineType(types: !398)
!398 = !{!106, !279, !44, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!400 = !{!395, !401, !402, !403}
!401 = !DILocalVariable(name: "data_end", arg: 2, scope: !396, file: !181, line: 207, type: !44)
!402 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !396, file: !181, line: 208, type: !399)
!403 = !DILocalVariable(name: "h", scope: !396, file: !181, line: 210, type: !232)
!404 = !DILocation(line: 0, scope: !396, inlinedAt: !405)
!405 = distinct !DILocation(line: 100, column: 14, scope: !164)
!406 = !DILocation(line: 212, column: 8, scope: !407, inlinedAt: !405)
!407 = distinct !DILexicalBlock(scope: !396, file: !181, line: 212, column: 6)
!408 = !DILocation(line: 212, column: 14, scope: !407, inlinedAt: !405)
!409 = !DILocation(line: 212, column: 12, scope: !407, inlinedAt: !405)
!410 = !DILocation(line: 212, column: 6, scope: !396, inlinedAt: !405)
!411 = !DILocation(line: 218, column: 12, scope: !396, inlinedAt: !405)
!412 = !{!413, !266, i64 0}
!413 = !{!"icmphdr_common", !266, i64 0, !266, i64 1, !320, i64 2}
!414 = !DILocation(line: 101, column: 51, scope: !252)
!415 = !DILocation(line: 101, column: 38, scope: !252)
!416 = !DILocalVariable(name: "iphdr", arg: 1, scope: !417, file: !243, line: 136, type: !197)
!417 = distinct !DISubprogram(name: "swap_src_dst_ipv4", scope: !243, file: !243, line: 136, type: !418, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !420)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !197}
!420 = !{!416, !421}
!421 = !DILocalVariable(name: "tmp", scope: !417, file: !243, line: 138, type: !70)
!422 = !DILocation(line: 0, scope: !417, inlinedAt: !423)
!423 = distinct !DILocation(line: 103, column: 3, scope: !424)
!424 = distinct !DILexicalBlock(scope: !252, file: !3, line: 101, column: 65)
!425 = !DILocation(line: 138, column: 22, scope: !417, inlinedAt: !423)
!426 = !{!364, !265, i64 12}
!427 = !DILocation(line: 140, column: 24, scope: !417, inlinedAt: !423)
!428 = !{!364, !265, i64 16}
!429 = !DILocation(line: 140, column: 15, scope: !417, inlinedAt: !423)
!430 = !DILocation(line: 141, column: 15, scope: !417, inlinedAt: !423)
!431 = !DILocation(line: 105, column: 2, scope: !424)
!432 = !DILocation(line: 105, column: 22, scope: !251)
!433 = !DILocation(line: 106, column: 19, scope: !251)
!434 = !DILocation(line: 106, column: 6, scope: !251)
!435 = !DILocation(line: 0, scope: !242, inlinedAt: !249)
!436 = !DILocation(line: 127, column: 2, scope: !242, inlinedAt: !249)
!437 = !DILocation(line: 127, column: 30, scope: !242, inlinedAt: !249)
!438 = !{i64 0, i64 16, !439, i64 0, i64 16, !439, i64 0, i64 16, !439}
!439 = !{!266, !266, i64 0}
!440 = !DILocation(line: 129, column: 22, scope: !242, inlinedAt: !249)
!441 = !DILocation(line: 130, column: 16, scope: !242, inlinedAt: !249)
!442 = !DILocation(line: 131, column: 1, scope: !242, inlinedAt: !249)
!443 = !DILocation(line: 0, scope: !254, inlinedAt: !260)
!444 = !DILocation(line: 115, column: 2, scope: !254, inlinedAt: !260)
!445 = !DILocation(line: 117, column: 2, scope: !254, inlinedAt: !260)
!446 = !DILocation(line: 118, column: 2, scope: !254, inlinedAt: !260)
!447 = !DILocation(line: 119, column: 2, scope: !254, inlinedAt: !260)
!448 = !DILocation(line: 120, column: 1, scope: !254, inlinedAt: !260)
!449 = !DILocation(line: 119, column: 22, scope: !164)
!450 = !{!413, !320, i64 2}
!451 = !DILocation(line: 120, column: 17, scope: !164)
!452 = !DILocation(line: 121, column: 17, scope: !164)
!453 = !DILocation(line: 121, column: 16, scope: !164)
!454 = !DILocation(line: 122, column: 16, scope: !164)
!455 = !DILocation(line: 123, column: 38, scope: !164)
!456 = !DILocalVariable(name: "seed", arg: 1, scope: !457, file: !3, line: 49, type: !46)
!457 = distinct !DISubprogram(name: "icmp_checksum_diff", scope: !3, file: !3, line: 48, type: !458, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !460)
!458 = !DISubroutineType(types: !459)
!459 = !{!46, !46, !232, !232}
!460 = !{!456, !461, !462, !463, !464}
!461 = !DILocalVariable(name: "icmphdr_new", arg: 2, scope: !457, file: !3, line: 50, type: !232)
!462 = !DILocalVariable(name: "icmphdr_old", arg: 3, scope: !457, file: !3, line: 51, type: !232)
!463 = !DILocalVariable(name: "csum", scope: !457, file: !3, line: 53, type: !71)
!464 = !DILocalVariable(name: "size", scope: !457, file: !3, line: 53, type: !71)
!465 = !DILocation(line: 0, scope: !457, inlinedAt: !466)
!466 = distinct !DILocation(line: 123, column: 19, scope: !164)
!467 = !DILocation(line: 55, column: 81, scope: !457, inlinedAt: !466)
!468 = !DILocation(line: 55, column: 9, scope: !457, inlinedAt: !466)
!469 = !DILocalVariable(name: "csum", arg: 1, scope: !470, file: !3, line: 33, type: !71)
!470 = distinct !DISubprogram(name: "csum_fold_helper", scope: !3, file: !3, line: 33, type: !471, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{!46, !71}
!473 = !{!469, !474}
!474 = !DILocalVariable(name: "sum", scope: !470, file: !3, line: 35, type: !71)
!475 = !DILocation(line: 0, scope: !470, inlinedAt: !476)
!476 = distinct !DILocation(line: 56, column: 9, scope: !457, inlinedAt: !466)
!477 = !DILocation(line: 36, column: 14, scope: !470, inlinedAt: !476)
!478 = !DILocation(line: 36, column: 29, scope: !470, inlinedAt: !476)
!479 = !DILocation(line: 36, column: 21, scope: !470, inlinedAt: !476)
!480 = !DILocation(line: 37, column: 14, scope: !470, inlinedAt: !476)
!481 = !DILocation(line: 37, column: 6, scope: !470, inlinedAt: !476)
!482 = !DILocation(line: 38, column: 9, scope: !470, inlinedAt: !476)
!483 = !DILocation(line: 123, column: 17, scope: !164)
!484 = !DILocation(line: 146, column: 2, scope: !164)
!485 = !DILocation(line: 148, column: 1, scope: !164)
!486 = !DILocation(line: 0, scope: !487, inlinedAt: !500)
!487 = distinct !DISubprogram(name: "xdp_stats_record_action", scope: !159, file: !159, line: 24, type: !488, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !490)
!488 = !DISubroutineType(types: !489)
!489 = !{!71, !167, !71}
!490 = !{!491, !492, !493}
!491 = !DILocalVariable(name: "ctx", arg: 1, scope: !487, file: !159, line: 24, type: !167)
!492 = !DILocalVariable(name: "action", arg: 2, scope: !487, file: !159, line: 24, type: !71)
!493 = !DILocalVariable(name: "rec", scope: !487, file: !159, line: 30, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !496, line: 10, size: 128, elements: !497)
!496 = !DIFile(filename: "./../common/xdp_stats_kern_user.h", directory: "/home/saif/Desktop/xdp-tutorial/packet-solutions")
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !495, file: !496, line: 11, baseType: !107, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !495, file: !496, line: 12, baseType: !107, size: 64, offset: 64)
!500 = distinct !DILocation(line: 149, column: 9, scope: !164)
!501 = !{!265, !265, i64 0}
!502 = !DILocation(line: 30, column: 24, scope: !487, inlinedAt: !500)
!503 = !DILocation(line: 31, column: 7, scope: !504, inlinedAt: !500)
!504 = distinct !DILexicalBlock(scope: !487, file: !159, line: 31, column: 6)
!505 = !DILocation(line: 31, column: 6, scope: !487, inlinedAt: !500)
!506 = !DILocation(line: 38, column: 7, scope: !487, inlinedAt: !500)
!507 = !DILocation(line: 38, column: 17, scope: !487, inlinedAt: !500)
!508 = !{!509, !510, i64 0}
!509 = !{!"datarec", !510, i64 0, !510, i64 8}
!510 = !{!"long long", !266, i64 0}
!511 = !DILocation(line: 39, column: 25, scope: !487, inlinedAt: !500)
!512 = !DILocation(line: 39, column: 41, scope: !487, inlinedAt: !500)
!513 = !DILocation(line: 39, column: 34, scope: !487, inlinedAt: !500)
!514 = !DILocation(line: 39, column: 19, scope: !487, inlinedAt: !500)
!515 = !DILocation(line: 39, column: 7, scope: !487, inlinedAt: !500)
!516 = !DILocation(line: 39, column: 16, scope: !487, inlinedAt: !500)
!517 = !{!509, !510, i64 8}
!518 = !DILocation(line: 41, column: 9, scope: !487, inlinedAt: !500)
!519 = !DILocation(line: 41, column: 2, scope: !487, inlinedAt: !500)
!520 = !DILocation(line: 42, column: 1, scope: !487, inlinedAt: !500)
!521 = !DILocation(line: 150, column: 1, scope: !164)
!522 = !DILocation(line: 149, column: 2, scope: !164)
!523 = distinct !DISubprogram(name: "xdp_redirect_func", scope: !3, file: !3, line: 154, type: !165, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!525 = !DILocalVariable(name: "ctx", arg: 1, scope: !523, file: !3, line: 154, type: !167)
!526 = !DILocalVariable(name: "data_end", scope: !523, file: !3, line: 156, type: !44)
!527 = !DILocalVariable(name: "data", scope: !523, file: !3, line: 157, type: !44)
!528 = !DILocalVariable(name: "nh", scope: !523, file: !3, line: 158, type: !180)
!529 = !DILocalVariable(name: "eth", scope: !523, file: !3, line: 159, type: !185)
!530 = !DILocalVariable(name: "eth_type", scope: !523, file: !3, line: 160, type: !106)
!531 = !DILocalVariable(name: "action", scope: !523, file: !3, line: 161, type: !106)
!532 = !DILocalVariable(name: "dst", scope: !523, file: !3, line: 162, type: !190)
!533 = !DILocalVariable(name: "ifindex", scope: !523, file: !3, line: 163, type: !7)
!534 = !DILabel(scope: !523, name: "out", file: !3, line: 177)
!535 = !DILocation(line: 0, scope: !523)
!536 = !DILocation(line: 156, column: 38, scope: !523)
!537 = !DILocation(line: 156, column: 27, scope: !523)
!538 = !DILocation(line: 156, column: 19, scope: !523)
!539 = !DILocation(line: 157, column: 34, scope: !523)
!540 = !DILocation(line: 157, column: 23, scope: !523)
!541 = !DILocation(line: 157, column: 15, scope: !523)
!542 = !DILocation(line: 162, column: 2, scope: !523)
!543 = !DILocation(line: 162, column: 16, scope: !523)
!544 = !DILocation(line: 0, scope: !276, inlinedAt: !545)
!545 = distinct !DILocation(line: 169, column: 13, scope: !523)
!546 = !DILocation(line: 0, scope: !287, inlinedAt: !547)
!547 = distinct !DILocation(line: 129, column: 9, scope: !276, inlinedAt: !545)
!548 = !DILocation(line: 93, column: 14, scope: !314, inlinedAt: !547)
!549 = !DILocation(line: 93, column: 24, scope: !314, inlinedAt: !547)
!550 = !DILocation(line: 93, column: 6, scope: !287, inlinedAt: !547)
!551 = !DILocation(line: 97, column: 10, scope: !287, inlinedAt: !547)
!552 = !DILocation(line: 174, column: 2, scope: !523)
!553 = !DILocation(line: 175, column: 11, scope: !523)
!554 = !DILocation(line: 177, column: 1, scope: !523)
!555 = !DILocation(line: 0, scope: !487, inlinedAt: !556)
!556 = distinct !DILocation(line: 178, column: 9, scope: !523)
