; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.icmphdr_common = type { i8, i8, i16 }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, i16, i32, %union.anon.0, %union.anon.1, %union.anon.2, i16, i16, [6 x i8], [6 x i8] }
%union.anon.0 = type { i32 }
%union.anon.1 = type { [4 x i32] }
%union.anon.2 = type { [4 x i32] }

@xdp_stats_map = dso_local global %struct.bpf_map_def { i32 6, i32 4, i32 16, i32 5, i32 0 }, section "maps", align 4, !dbg !0
@tx_port = dso_local global %struct.bpf_map_def { i32 14, i32 4, i32 4, i32 256, i32 0 }, section "maps", align 4, !dbg !50
@redirect_params = dso_local global %struct.bpf_map_def { i32 1, i32 6, i32 6, i32 1, i32 0 }, section "maps", align 4, !dbg !60
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !62

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !128, line: 16, type: !52, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !49, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/saif/Desktop/xdp-tutorial/packet03-redirecting")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/saif/Desktop/xdp-tutorial/packet03-redirecting")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !47, line: 24, baseType: !48)
!47 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !{!0, !50, !60, !62, !68, !76, !85}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 18, type: !52, isLocal: false, isDefinition: true)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !53, line: 33, size: 160, elements: !54)
!53 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/saif/Desktop/xdp-tutorial/packet03-redirecting")
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !53, line: 34, baseType: !7, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !52, file: !53, line: 35, baseType: !7, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !52, file: !53, line: 36, baseType: !7, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !52, file: !53, line: 37, baseType: !7, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !52, file: !53, line: 38, baseType: !7, size: 32, offset: 128)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "redirect_params", scope: !2, file: !3, line: 25, type: !52, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 274, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 32, elements: !66)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!66 = !{!67}
!67 = !DISubrange(count: 4)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !70, line: 33, type: !71, isLocal: true, isDefinition: true)
!70 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/saif/Desktop/xdp-tutorial/packet03-redirecting")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!44, !44, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !70, line: 1254, type: !78, isLocal: true, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !44, !82, !83}
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !47, line: 27, baseType: !7)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !47, line: 31, baseType: !84)
!84 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !70, line: 1764, type: !87, isLocal: true, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!81, !44, !90, !81, !82}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 3179, size: 512, elements: !92)
!92 = !{!93, !96, !97, !100, !101, !102, !103, !110, !116, !121, !122, !123, !127}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !91, file: !6, line: 3183, baseType: !94, size: 8)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !47, line: 21, baseType: !95)
!95 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !91, file: !6, line: 3186, baseType: !94, size: 8, offset: 8)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !91, file: !6, line: 3187, baseType: !98, size: 16, offset: 16)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !99, line: 25, baseType: !46)
!99 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !91, file: !6, line: 3188, baseType: !98, size: 16, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !91, file: !6, line: 3191, baseType: !46, size: 16, offset: 48)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !91, file: !6, line: 3196, baseType: !82, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, scope: !91, file: !6, line: 3198, baseType: !104, size: 32, offset: 96)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !91, file: !6, line: 3198, size: 32, elements: !105)
!105 = !{!106, !107, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !104, file: !6, line: 3200, baseType: !94, size: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !104, file: !6, line: 3201, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !99, line: 27, baseType: !82)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !104, file: !6, line: 3204, baseType: !82, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, scope: !91, file: !6, line: 3207, baseType: !111, size: 128, offset: 128)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !91, file: !6, line: 3207, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !111, file: !6, line: 3208, baseType: !108, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !111, file: !6, line: 3209, baseType: !115, size: 128)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 128, elements: !66)
!116 = !DIDerivedType(tag: DW_TAG_member, scope: !91, file: !6, line: 3216, baseType: !117, size: 128, offset: 256)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !91, file: !6, line: 3216, size: 128, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !117, file: !6, line: 3217, baseType: !108, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !117, file: !6, line: 3218, baseType: !115, size: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !91, file: !6, line: 3222, baseType: !98, size: 16, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !91, file: !6, line: 3223, baseType: !98, size: 16, offset: 400)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !91, file: !6, line: 3224, baseType: !124, size: 48, offset: 416)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 48, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 6)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !91, file: !6, line: 3225, baseType: !124, size: 48, offset: 464)
!128 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/saif/Desktop/xdp-tutorial/packet03-redirecting")
!129 = !{i32 7, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{i32 1, !"wchar_size", i32 4}
!132 = !{!"clang version 10.0.0-4ubuntu1 "}
!133 = distinct !DISubprogram(name: "xdp_icmp_echo_func", scope: !3, file: !3, line: 49, type: !134, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !144)
!134 = !DISubroutineType(types: !135)
!135 = !{!81, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !138)
!138 = !{!139, !140, !141, !142, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !137, file: !6, line: 2857, baseType: !82, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !137, file: !6, line: 2858, baseType: !82, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !137, file: !6, line: 2859, baseType: !82, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !137, file: !6, line: 2861, baseType: !82, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !137, file: !6, line: 2862, baseType: !82, size: 32, offset: 128)
!144 = !{!145, !146, !147, !148, !153, !162, !163, !164, !165, !182, !214, !215, !222, !223}
!145 = !DILocalVariable(name: "ctx", arg: 1, scope: !133, file: !3, line: 49, type: !136)
!146 = !DILocalVariable(name: "data_end", scope: !133, file: !3, line: 51, type: !44)
!147 = !DILocalVariable(name: "data", scope: !133, file: !3, line: 52, type: !44)
!148 = !DILocalVariable(name: "nh", scope: !133, file: !3, line: 53, type: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !150, line: 33, size: 64, elements: !151)
!150 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/saif/Desktop/xdp-tutorial/packet03-redirecting")
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !149, file: !150, line: 34, baseType: !44, size: 64)
!153 = !DILocalVariable(name: "eth", scope: !133, file: !3, line: 54, type: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !156, line: 163, size: 112, elements: !157)
!156 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!157 = !{!158, !160, !161}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !155, file: !156, line: 164, baseType: !159, size: 48)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 48, elements: !125)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !155, file: !156, line: 165, baseType: !159, size: 48, offset: 48)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !155, file: !156, line: 166, baseType: !98, size: 16, offset: 96)
!162 = !DILocalVariable(name: "eth_type", scope: !133, file: !3, line: 55, type: !81)
!163 = !DILocalVariable(name: "ip_type", scope: !133, file: !3, line: 56, type: !81)
!164 = !DILocalVariable(name: "icmp_type", scope: !133, file: !3, line: 57, type: !81)
!165 = !DILocalVariable(name: "iphdr", scope: !133, file: !3, line: 58, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !168, line: 86, size: 160, elements: !169)
!168 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !180, !181}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !167, file: !168, line: 88, baseType: !94, size: 4, flags: DIFlagBitField, extraData: i64 0)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !167, file: !168, line: 89, baseType: !94, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !167, file: !168, line: 96, baseType: !94, size: 8, offset: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !167, file: !168, line: 97, baseType: !98, size: 16, offset: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !167, file: !168, line: 98, baseType: !98, size: 16, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !167, file: !168, line: 99, baseType: !98, size: 16, offset: 48)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !167, file: !168, line: 100, baseType: !94, size: 8, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !167, file: !168, line: 101, baseType: !94, size: 8, offset: 72)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !167, file: !168, line: 102, baseType: !179, size: 16, offset: 80)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !99, line: 31, baseType: !46)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !167, file: !168, line: 103, baseType: !108, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !167, file: !168, line: 104, baseType: !108, size: 32, offset: 128)
!182 = !DILocalVariable(name: "ipv6hdr", scope: !133, file: !3, line: 59, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !185, line: 116, size: 320, elements: !186)
!185 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!186 = !{!187, !188, !189, !193, !194, !195, !196, !213}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !184, file: !185, line: 118, baseType: !94, size: 4, flags: DIFlagBitField, extraData: i64 0)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !184, file: !185, line: 119, baseType: !94, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !184, file: !185, line: 126, baseType: !190, size: 24, offset: 8)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 24, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 3)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !184, file: !185, line: 128, baseType: !98, size: 16, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !184, file: !185, line: 129, baseType: !94, size: 8, offset: 48)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !184, file: !185, line: 130, baseType: !94, size: 8, offset: 56)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !184, file: !185, line: 132, baseType: !197, size: 128, offset: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !198, line: 33, size: 128, elements: !199)
!198 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !197, file: !198, line: 40, baseType: !201, size: 128)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !197, file: !198, line: 34, size: 128, elements: !202)
!202 = !{!203, !207, !211}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !201, file: !198, line: 35, baseType: !204, size: 128)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 16)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !201, file: !198, line: 37, baseType: !208, size: 128)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !201, file: !198, line: 38, baseType: !212, size: 128)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, elements: !66)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !184, file: !185, line: 133, baseType: !197, size: 128, offset: 192)
!214 = !DILocalVariable(name: "echo_reply", scope: !133, file: !3, line: 60, type: !46)
!215 = !DILocalVariable(name: "icmphdr", scope: !133, file: !3, line: 61, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr_common", file: !150, line: 51, size: 32, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !150, line: 52, baseType: !94, size: 8)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !217, file: !150, line: 53, baseType: !94, size: 8, offset: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !217, file: !150, line: 54, baseType: !179, size: 16, offset: 16)
!222 = !DILocalVariable(name: "action", scope: !133, file: !3, line: 62, type: !82)
!223 = !DILabel(scope: !133, name: "out", file: !3, line: 109)
!224 = !DILocation(line: 0, scope: !133)
!225 = !DILocation(line: 51, column: 38, scope: !133)
!226 = !{!227, !228, i64 4}
!227 = !{!"xdp_md", !228, i64 0, !228, i64 4, !228, i64 8, !228, i64 12, !228, i64 16}
!228 = !{!"int", !229, i64 0}
!229 = !{!"omnipotent char", !230, i64 0}
!230 = !{!"Simple C/C++ TBAA"}
!231 = !DILocation(line: 51, column: 27, scope: !133)
!232 = !DILocation(line: 51, column: 19, scope: !133)
!233 = !DILocation(line: 52, column: 34, scope: !133)
!234 = !{!227, !228, i64 0}
!235 = !DILocation(line: 52, column: 23, scope: !133)
!236 = !DILocation(line: 52, column: 15, scope: !133)
!237 = !DILocalVariable(name: "nh", arg: 1, scope: !238, file: !150, line: 124, type: !241)
!238 = distinct !DISubprogram(name: "parse_ethhdr", scope: !150, file: !150, line: 124, type: !239, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !243)
!239 = !DISubroutineType(types: !240)
!240 = !{!81, !241, !44, !242}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!243 = !{!237, !244, !245}
!244 = !DILocalVariable(name: "data_end", arg: 2, scope: !238, file: !150, line: 125, type: !44)
!245 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !238, file: !150, line: 126, type: !242)
!246 = !DILocation(line: 0, scope: !238, inlinedAt: !247)
!247 = distinct !DILocation(line: 68, column: 13, scope: !133)
!248 = !DILocalVariable(name: "nh", arg: 1, scope: !249, file: !150, line: 79, type: !241)
!249 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !150, file: !150, line: 79, type: !250, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !259)
!250 = !DISubroutineType(types: !251)
!251 = !{!81, !241, !44, !242, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !150, line: 64, size: 32, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !253, file: !150, line: 65, baseType: !256, size: 32)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 2)
!259 = !{!248, !260, !261, !262, !263, !264, !265, !271, !272}
!260 = !DILocalVariable(name: "data_end", arg: 2, scope: !249, file: !150, line: 80, type: !44)
!261 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !249, file: !150, line: 81, type: !242)
!262 = !DILocalVariable(name: "vlans", arg: 4, scope: !249, file: !150, line: 82, type: !252)
!263 = !DILocalVariable(name: "eth", scope: !249, file: !150, line: 84, type: !154)
!264 = !DILocalVariable(name: "hdrsize", scope: !249, file: !150, line: 85, type: !81)
!265 = !DILocalVariable(name: "vlh", scope: !249, file: !150, line: 86, type: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !150, line: 42, size: 32, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !267, file: !150, line: 43, baseType: !98, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !267, file: !150, line: 44, baseType: !98, size: 16, offset: 16)
!271 = !DILocalVariable(name: "h_proto", scope: !249, file: !150, line: 87, type: !46)
!272 = !DILocalVariable(name: "i", scope: !249, file: !150, line: 88, type: !81)
!273 = !DILocation(line: 0, scope: !249, inlinedAt: !274)
!274 = distinct !DILocation(line: 129, column: 9, scope: !238, inlinedAt: !247)
!275 = !DILocation(line: 93, column: 14, scope: !276, inlinedAt: !274)
!276 = distinct !DILexicalBlock(scope: !249, file: !150, line: 93, column: 6)
!277 = !DILocation(line: 93, column: 24, scope: !276, inlinedAt: !274)
!278 = !DILocation(line: 93, column: 6, scope: !249, inlinedAt: !274)
!279 = !DILocation(line: 99, column: 17, scope: !249, inlinedAt: !274)
!280 = !{!281, !281, i64 0}
!281 = !{!"short", !229, i64 0}
!282 = !DILocation(line: 0, scope: !283, inlinedAt: !274)
!283 = distinct !DILexicalBlock(scope: !284, file: !150, line: 109, column: 7)
!284 = distinct !DILexicalBlock(scope: !285, file: !150, line: 105, column: 39)
!285 = distinct !DILexicalBlock(scope: !286, file: !150, line: 105, column: 2)
!286 = distinct !DILexicalBlock(scope: !249, file: !150, line: 105, column: 2)
!287 = !DILocation(line: 105, column: 2, scope: !286, inlinedAt: !274)
!288 = !DILocation(line: 106, column: 7, scope: !284, inlinedAt: !274)
!289 = !DILocation(line: 109, column: 11, scope: !283, inlinedAt: !274)
!290 = !DILocation(line: 109, column: 15, scope: !283, inlinedAt: !274)
!291 = !DILocation(line: 109, column: 7, scope: !284, inlinedAt: !274)
!292 = !DILocation(line: 112, column: 18, scope: !284, inlinedAt: !274)
!293 = !DILocation(line: 69, column: 6, scope: !133)
!294 = !DILocalVariable(name: "nh", arg: 1, scope: !295, file: !150, line: 151, type: !241)
!295 = distinct !DISubprogram(name: "parse_iphdr", scope: !150, file: !150, line: 151, type: !296, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !299)
!296 = !DISubroutineType(types: !297)
!297 = !{!81, !241, !44, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!299 = !{!294, !300, !301, !302, !303}
!300 = !DILocalVariable(name: "data_end", arg: 2, scope: !295, file: !150, line: 152, type: !44)
!301 = !DILocalVariable(name: "iphdr", arg: 3, scope: !295, file: !150, line: 153, type: !298)
!302 = !DILocalVariable(name: "iph", scope: !295, file: !150, line: 155, type: !166)
!303 = !DILocalVariable(name: "hdrsize", scope: !295, file: !150, line: 156, type: !81)
!304 = !DILocation(line: 0, scope: !295, inlinedAt: !305)
!305 = distinct !DILocation(line: 70, column: 13, scope: !306)
!306 = distinct !DILexicalBlock(scope: !307, file: !3, line: 69, column: 39)
!307 = distinct !DILexicalBlock(scope: !133, file: !3, line: 69, column: 6)
!308 = !DILocation(line: 158, column: 10, scope: !309, inlinedAt: !305)
!309 = distinct !DILexicalBlock(scope: !295, file: !150, line: 158, column: 6)
!310 = !DILocation(line: 158, column: 14, scope: !309, inlinedAt: !305)
!311 = !DILocation(line: 158, column: 6, scope: !295, inlinedAt: !305)
!312 = !DILocation(line: 161, column: 17, scope: !295, inlinedAt: !305)
!313 = !DILocation(line: 161, column: 21, scope: !295, inlinedAt: !305)
!314 = !DILocation(line: 163, column: 13, scope: !315, inlinedAt: !305)
!315 = distinct !DILexicalBlock(scope: !295, file: !150, line: 163, column: 5)
!316 = !DILocation(line: 163, column: 5, scope: !295, inlinedAt: !305)
!317 = !DILocation(line: 163, column: 5, scope: !315, inlinedAt: !305)
!318 = !DILocation(line: 167, column: 14, scope: !319, inlinedAt: !305)
!319 = distinct !DILexicalBlock(scope: !295, file: !150, line: 167, column: 6)
!320 = !DILocation(line: 167, column: 24, scope: !319, inlinedAt: !305)
!321 = !DILocation(line: 167, column: 6, scope: !295, inlinedAt: !305)
!322 = !DILocation(line: 173, column: 14, scope: !295, inlinedAt: !305)
!323 = !{!324, !229, i64 9}
!324 = !{!"iphdr", !229, i64 0, !229, i64 0, !229, i64 1, !281, i64 2, !281, i64 4, !281, i64 6, !229, i64 8, !229, i64 9, !281, i64 10, !228, i64 12, !228, i64 16}
!325 = !DILocation(line: 71, column: 15, scope: !326)
!326 = distinct !DILexicalBlock(scope: !306, file: !3, line: 71, column: 7)
!327 = !DILocation(line: 71, column: 7, scope: !306)
!328 = !DILocalVariable(name: "nh", arg: 1, scope: !329, file: !150, line: 132, type: !241)
!329 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !150, file: !150, line: 132, type: !330, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !333)
!330 = !DISubroutineType(types: !331)
!331 = !{!81, !241, !44, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!333 = !{!328, !334, !335, !336}
!334 = !DILocalVariable(name: "data_end", arg: 2, scope: !329, file: !150, line: 133, type: !44)
!335 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !329, file: !150, line: 134, type: !332)
!336 = !DILocalVariable(name: "ip6h", scope: !329, file: !150, line: 136, type: !183)
!337 = !DILocation(line: 0, scope: !329, inlinedAt: !338)
!338 = distinct !DILocation(line: 74, column: 13, scope: !339)
!339 = distinct !DILexicalBlock(scope: !340, file: !3, line: 73, column: 48)
!340 = distinct !DILexicalBlock(scope: !307, file: !3, line: 73, column: 13)
!341 = !DILocation(line: 142, column: 11, scope: !342, inlinedAt: !338)
!342 = distinct !DILexicalBlock(scope: !329, file: !150, line: 142, column: 6)
!343 = !DILocation(line: 142, column: 17, scope: !342, inlinedAt: !338)
!344 = !DILocation(line: 142, column: 15, scope: !342, inlinedAt: !338)
!345 = !DILocation(line: 142, column: 6, scope: !329, inlinedAt: !338)
!346 = !DILocation(line: 148, column: 15, scope: !329, inlinedAt: !338)
!347 = !{!348, !229, i64 6}
!348 = !{!"ipv6hdr", !229, i64 0, !229, i64 0, !229, i64 1, !281, i64 4, !229, i64 6, !229, i64 7, !349, i64 8, !349, i64 24}
!349 = !{!"in6_addr", !229, i64 0}
!350 = !DILocation(line: 75, column: 15, scope: !351)
!351 = distinct !DILexicalBlock(scope: !339, file: !3, line: 75, column: 7)
!352 = !DILocation(line: 75, column: 7, scope: !339)
!353 = !DILocation(line: 65, column: 9, scope: !133)
!354 = !DILocalVariable(name: "nh", arg: 1, scope: !355, file: !150, line: 206, type: !241)
!355 = distinct !DISubprogram(name: "parse_icmphdr_common", scope: !150, file: !150, line: 206, type: !356, scopeLine: 209, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !359)
!356 = !DISubroutineType(types: !357)
!357 = !{!81, !241, !44, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!359 = !{!354, !360, !361, !362}
!360 = !DILocalVariable(name: "data_end", arg: 2, scope: !355, file: !150, line: 207, type: !44)
!361 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !355, file: !150, line: 208, type: !358)
!362 = !DILocalVariable(name: "h", scope: !355, file: !150, line: 210, type: !216)
!363 = !DILocation(line: 0, scope: !355, inlinedAt: !364)
!364 = distinct !DILocation(line: 87, column: 14, scope: !133)
!365 = !DILocation(line: 212, column: 8, scope: !366, inlinedAt: !364)
!366 = distinct !DILexicalBlock(scope: !355, file: !150, line: 212, column: 6)
!367 = !DILocation(line: 212, column: 14, scope: !366, inlinedAt: !364)
!368 = !DILocation(line: 212, column: 12, scope: !366, inlinedAt: !364)
!369 = !DILocation(line: 212, column: 6, scope: !355, inlinedAt: !364)
!370 = !DILocation(line: 218, column: 12, scope: !355, inlinedAt: !364)
!371 = !{!372, !229, i64 0}
!372 = !{!"icmphdr_common", !229, i64 0, !229, i64 1, !281, i64 2}
!373 = !DILocation(line: 88, column: 51, scope: !374)
!374 = distinct !DILexicalBlock(scope: !133, file: !3, line: 88, column: 6)
!375 = !DILocation(line: 88, column: 38, scope: !374)
!376 = !DILocation(line: 92, column: 22, scope: !377)
!377 = distinct !DILexicalBlock(scope: !374, file: !3, line: 92, column: 13)
!378 = !DILocation(line: 93, column: 19, scope: !377)
!379 = !DILocation(line: 93, column: 6, scope: !377)
!380 = !DILocation(line: 107, column: 2, scope: !133)
!381 = !DILocation(line: 109, column: 1, scope: !133)
!382 = !DILocation(line: 0, scope: !383, inlinedAt: !396)
!383 = distinct !DISubprogram(name: "xdp_stats_record_action", scope: !128, file: !128, line: 24, type: !384, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{!82, !136, !82}
!386 = !{!387, !388, !389}
!387 = !DILocalVariable(name: "ctx", arg: 1, scope: !383, file: !128, line: 24, type: !136)
!388 = !DILocalVariable(name: "action", arg: 2, scope: !383, file: !128, line: 24, type: !82)
!389 = !DILocalVariable(name: "rec", scope: !383, file: !128, line: 30, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !392, line: 10, size: 128, elements: !393)
!392 = !DIFile(filename: "./../common/xdp_stats_kern_user.h", directory: "/home/saif/Desktop/xdp-tutorial/packet03-redirecting")
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !391, file: !392, line: 11, baseType: !83, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !391, file: !392, line: 12, baseType: !83, size: 64, offset: 64)
!396 = distinct !DILocation(line: 110, column: 9, scope: !133)
!397 = !{!228, !228, i64 0}
!398 = !DILocation(line: 30, column: 24, scope: !383, inlinedAt: !396)
!399 = !DILocation(line: 31, column: 7, scope: !400, inlinedAt: !396)
!400 = distinct !DILexicalBlock(scope: !383, file: !128, line: 31, column: 6)
!401 = !DILocation(line: 31, column: 6, scope: !383, inlinedAt: !396)
!402 = !DILocation(line: 38, column: 7, scope: !383, inlinedAt: !396)
!403 = !DILocation(line: 38, column: 17, scope: !383, inlinedAt: !396)
!404 = !{!405, !406, i64 0}
!405 = !{!"datarec", !406, i64 0, !406, i64 8}
!406 = !{!"long long", !229, i64 0}
!407 = !DILocation(line: 39, column: 25, scope: !383, inlinedAt: !396)
!408 = !DILocation(line: 39, column: 41, scope: !383, inlinedAt: !396)
!409 = !DILocation(line: 39, column: 34, scope: !383, inlinedAt: !396)
!410 = !DILocation(line: 39, column: 19, scope: !383, inlinedAt: !396)
!411 = !DILocation(line: 39, column: 7, scope: !383, inlinedAt: !396)
!412 = !DILocation(line: 39, column: 16, scope: !383, inlinedAt: !396)
!413 = !{!405, !406, i64 8}
!414 = !DILocation(line: 41, column: 9, scope: !383, inlinedAt: !396)
!415 = !DILocation(line: 41, column: 2, scope: !383, inlinedAt: !396)
!416 = !DILocation(line: 42, column: 1, scope: !383, inlinedAt: !396)
!417 = !DILocation(line: 110, column: 2, scope: !133)
!418 = distinct !DISubprogram(name: "xdp_redirect_func", scope: !3, file: !3, line: 115, type: !134, scopeLine: 116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427}
!420 = !DILocalVariable(name: "ctx", arg: 1, scope: !418, file: !3, line: 115, type: !136)
!421 = !DILocalVariable(name: "data_end", scope: !418, file: !3, line: 117, type: !44)
!422 = !DILocalVariable(name: "data", scope: !418, file: !3, line: 118, type: !44)
!423 = !DILocalVariable(name: "nh", scope: !418, file: !3, line: 119, type: !149)
!424 = !DILocalVariable(name: "eth", scope: !418, file: !3, line: 120, type: !154)
!425 = !DILocalVariable(name: "eth_type", scope: !418, file: !3, line: 121, type: !81)
!426 = !DILocalVariable(name: "action", scope: !418, file: !3, line: 122, type: !81)
!427 = !DILabel(scope: !418, name: "out", file: !3, line: 137)
!428 = !DILocation(line: 0, scope: !418)
!429 = !DILocation(line: 137, column: 1, scope: !418)
!430 = !DILocation(line: 0, scope: !383, inlinedAt: !431)
!431 = distinct !DILocation(line: 138, column: 9, scope: !418)
!432 = !DILocation(line: 30, column: 24, scope: !383, inlinedAt: !431)
!433 = !DILocation(line: 31, column: 7, scope: !400, inlinedAt: !431)
!434 = !DILocation(line: 31, column: 6, scope: !383, inlinedAt: !431)
!435 = !DILocation(line: 118, column: 34, scope: !418)
!436 = !DILocation(line: 117, column: 38, scope: !418)
!437 = !DILocation(line: 38, column: 7, scope: !383, inlinedAt: !431)
!438 = !DILocation(line: 38, column: 17, scope: !383, inlinedAt: !431)
!439 = !DILocation(line: 39, column: 25, scope: !383, inlinedAt: !431)
!440 = !DILocation(line: 39, column: 41, scope: !383, inlinedAt: !431)
!441 = !DILocation(line: 39, column: 34, scope: !383, inlinedAt: !431)
!442 = !DILocation(line: 39, column: 19, scope: !383, inlinedAt: !431)
!443 = !DILocation(line: 39, column: 7, scope: !383, inlinedAt: !431)
!444 = !DILocation(line: 39, column: 16, scope: !383, inlinedAt: !431)
!445 = !DILocation(line: 41, column: 9, scope: !383, inlinedAt: !431)
!446 = !DILocation(line: 41, column: 2, scope: !383, inlinedAt: !431)
!447 = !DILocation(line: 42, column: 1, scope: !383, inlinedAt: !431)
!448 = !DILocation(line: 138, column: 2, scope: !418)
